In [2]:
import pandas as pd

In [3]:
data_dir = "https://dlsun.github.io/pods/data/"
df_titanic = pd.read_csv(data_dir + "titanic.csv")

In [15]:
df_titanic[(df_titanic['age'] < 20) & (df_titanic['gender']=='male') & (df_titanic['survived']==1)]['name']

13                    Aks, Master. Frank Philip
22               Allison, Master. Hudson Trevor
58            Asplund, Master. Edvin Rojj Felix
62                   Asplund, Mr. Johan Charles
104                  Becker, Master. Richard F.
183               Caldwell, Master. Alden Gates
206         Carter, Master. William Thornton II
244                          Cohen, Mr. Gurshon
274              Coutts, Master. Neville Leslie
275                Coutts, Master. William Loch
304              Davies, Master. John Morgan jr
315                  Dean, Master. Bertram Vere
338                   Dodge, Master. Washington
344                  Dorking, Mr. Edward Arthur
353               Drew, Master. Marshall Brines
457       Goldsmith, Master. Frank John William
491     Hämäläinen, Master. Viljo Unto Johannes
613             Johnson, Master. Harold Theodor
761               Mallet, Master. André Clement
764                     Māmā, Mr. Hannā Mikā'īl
782                McCormack, Mr. Thomas Joseph
804                   Mellors, Mr. William John
829                         Moor, Master. Meier
840                      Mubārik, Master. Halīm
841                     Mubārik, Master. Jirjis
867              Navratil, Master. Edmond Roger
868             Navratil, Master. Michel Marcel
883                 Nīqūla Yārid, Master. Ilyās
906                   Olsen, Master. Artur Karl
967          Peter / Joseph, Master. Michael J.
1013            Richards, Master. Sibley George
1014             Richards, Master. William Rowe
1049                Ryerson, Master. John Borie
1144            Spedden, Master. Robert Douglas
1177                 Svensson, Mr. Johan Cervin
1182                      Tannūs, Master. As'ad
1193                Thayer, Mr. John Borland jr
1215               Tu'mah, Master. Jirjis Yūsuf
1265                Wells, Master. Ralph Lester
1335                Andrews, Mr. Charles Edward
1349                            Ball, Mr. Percy
1441                       Burgess, Mr. Charles
1485                          Collins, Mr. John
1520                 Daniels, Mr. Sidney Edward
1708                      Hyland, Mr. James Leo
1934                    Perry, Mr. Edgar Lionel
2166                Whiteley, Mr. Thomas Arthur
Name: name, dtype: object

In [17]:
df_titanic[['age','fare']].corr()

           age      fare
age   1.000000  0.184062
fare  0.184062  1.000000

In [23]:
df_titanic['age'].corr(df_titanic['fare']).round(4)

0.1841